# set default appdir to /Applications
cask_args appdir: '/Applications'

# Taps to check
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'josegonzalez/php'

# Coreutils
brew 'coreutils', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']

# Other bins
brew 'git'
brew 'git-flow'
brew 'node'
brew 'python3'
brew 'tree'
brew 'rsync'
brew 'thefuck'
brew 'tmux'

# Php related
brew 'josegonzalez/php/php70'
brew 'josegonzalez/php/php70-intl'
brew 'josegonzalez/php/php70-mcrypt'
brew 'josegonzalez/php/composer'

# Docker
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'docker-machine-parallels'

# Applications
cask 'atom'
cask 'chitchat'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrakecli'
cask 'intellij-idea'
cask 'iterm2'
cask 'macdown'
cask 'poedit'
cask 'sequel-pro'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'spotify-notifications'
cask 'steam'
cask 'transmission'
cask 'vlc'
cask 'vagrant'
