# set default appdir to /Applications
cask_args appdir: '/Applications'

# Taps to check
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'josegonzalez/php'

# Coreutils
brew 'coreutils', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']

# Other bins
brew 'git'
brew 'git-flow'
brew 'node'
brew 'python3'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'rsync'
brew 'thefuck'

# Applications
cask 'atom'
cask 'chitchat'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'keka'
cask 'macdown'
cask 'phpstorm'
cask 'poedit'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'spotify-notifications'
cask 'steam'
cask 'transmission'
cask 'vlc'

# Peer dependencies
brew 'pcre'
