# set default appdir to /Applications
#cask_args appdir: '/Applications'

# Taps to check
#tap 'caskroom/cask'
#tap 'caskroom/versions'
#tap 'homebrew/bundle'

# Coreutils
brew 'coreutils', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']

# Other bins
brew 'git'
brew 'git-flow'
brew 'tree'
brew 'rsync'

# Personal
cask 'atom'
cask 'docker'
cask 'iterm2'
cask 'keka'
cask 'sourcetree'
cask 'spotify'
# cask 'steam'
cask 'transmission'
# cask 'veracrypt'
cask 'vlc'

# Work
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'jetbrains-toolbox'
cask 'poedit'
cask 'postman'
cask 'sequel-pro'
cask 'visual-studio-code'
