# set default appdir to /Applications
#cask_args appdir: '/Applications'

# Taps to check
#tap 'caskroom/cask'
#tap 'caskroom/versions'
#tap 'homebrew/bundle'

# Coreutils
brew 'coreutils'
brew 'findutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'grep'
brew 'gnu-tar'

# Other bins
brew 'git'
brew 'git-flow'
brew 'tree'
brew 'rsync'
brew 'node'
brew 'testdisk'

# Personal
cask 'atom'
cask 'docker'
cask 'iterm2'
cask 'keka'
cask 'sourcetree'
cask 'spotify'
# cask 'steam'
cask 'transmission'
# cask 'veracrypt'
cask 'vlc'

# Work
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'jetbrains-toolbox'
cask 'poedit'
cask 'postman'
cask 'sequel-pro'
cask 'visual-studio-code'
