# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Coreutils
brew 'coreutils'
brew 'findutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'grep'
brew 'gnu-tar'

# Other bins
brew 'git'
brew 'git-flow'
brew 'tree'
brew 'rsync'
brew 'mas' # must come before using mas

# Personal
cask 'iterm2'
cask 'keka'
cask 'transmission'
cask 'vlc'
cask 'steam'
cask 'bettertouchtool'
mas 'Amphetamine', id: 937984704
mas 'Kiwi for Gmail', id: 986304488
mas 'Things 3', id: 904280696
mas 'WhatsApp', id: 1147396723

# Work
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
brew 'node@14'
